blog/2013-07-20-linkfest20130720.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 20.7.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning Real-Time Big Data Analytics: Emerging Architecture Machined Learnings: Using Less Data An IPython Notebook tutorial &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		<a class="facebook" href="http://www.facebook.com/ronert.obst" title="Facebook">Facebook</a>
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 20.7.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://blog.revolutionanalytics.com/2013/07/real-time-big-data-analytics-emerging-architecture.html">Real-Time Big Data Analytics: Emerging Architecture</a>
</li>
<li><a href="http://www.machinedlearnings.com/2013/07/using-less-data.html">Machined Learnings: Using Less Data</a>
</li>
<li><a href="http://nbviewer.ipython.org/urls/raw.github.com/agconti/kaggle-titanic/master/Titanic.ipynb">An IPython Notebook tutorial on competing in a Kaggle competition</a>
</li>
<li><a href="http://datacommunitydc.org/blog/2013/07/python-for-data-analysis-the-landscape-of-tutorials/">Python for Data Analysis: The Landscape of Tutorials - Data Community DC</a>
</li>
<li><a href="http://blog.revolutionanalytics.com/2013/07/high-performing-predictive-analytics-with-r-and-hadoop.html">High Performing Predictive Analytics with R and Hadoop</a>
</li>
<li><a href="http://blog.mortardata.com/post/55692866435/recommender-systems-best-talks">Mortar Blog | Recommended: 5 Great Talks on Recommender Systems</a>
</li>
<li><a href="http://www.iro.umontreal.ca/~bengioy/talks/deep-learning-tutorial-aaai2013.html">Deep Learning of Representations Tutorial AAAI 2013</a>
</li>
<li><a href="http://blog.echen.me/2011/07/18/introduction-to-restricted-boltzmann-machines/">Introduction to Restricted Boltzmann Machines - Edwin Chen&#8217;s Blog</a>
</li>
<li><a href="http://normaldeviate.wordpress.com/2013/07/13/lost-causes-in-statistics-ii-noninformative-priors/">LOST CAUSES IN STATISTICS II: Noninformative Priors « Normal Deviate</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.r-statistics.com/2013/07/tailor-your-tables-with-stargazer-new-features-for-latex-and-text-output/">Tailor Your Tables with stargazer: New Features for LaTeX and Text Output</a> 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://arxiv.org/abs/1307.4643">Predicting financial markets with Google Trends and not so random keywords</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://www.rafekettler.com/magicmethods.html">A Guide to Python&#8217;s Magic Methods « rafekettler.com</a>
</li>
<li><a href="http://www.rafekettler.com/magicmethods.html][A Guide to Python's Magic Methods « rafekettler.com]]">R documentation search - All R packages and R manuals from CRAN and Bioconductor</a>
</li>
<li><a href="http://existentialtype.wordpress.com/2013/07/18/what-if-anything-is-a-declarative-language/">What, If Anything, Is A Declarative Language? | Existential Type</a>
</li>
<li><a href="https://github.com/mikeizbicki/HLearn">HLearn – Homorphic Learning</a>
</li>
<li><a href="http://www.youtube.com/playlist?gl=DE&client=mv-google&hl=en&list=PLxj9UAX4Em-Ij4TKwKvo-SLp-Zbv-hB4B&nomobile=1">Haskell from Scratch - YouTube</a>
</li>
<li><a href="http://4dpiecharts.com/2013/07/16/how-r-will-turn-into-sql/">How R will turn into SQL</a>
</li>
<li><a href="http://fastml.com/running-things-on-a-gpu/">Running things on a GPU - FastML</a>
</li>
<li><a href="http://www.stat.washington.edu/~hoytak/blog/whypython.html?utm_content=buffer709c3&utm_source=buffer&utm_medium=twitter&utm_campaign=Buffer">10 Reasons Python Rocks for Research (And a Few Reasons it Doesn’t) — Hoyt Koepke</a>
</li>
<li><a href="http://appliedpredictivemodeling.com/blog/2013/7/13/user-2013-highlights">UseR! 2013 Highlights — Applied Predictive Modeling</a>
</li>
<li><a href="http://gallery.rcpp.org/articles/dmvnorm_arma/">Faster Multivariate Normal densities with RcppArmadillo and OpenMP</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-07-20T00:00:00+02:00" pubdate data-updated="true">Jul 20<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	<a class="addthis_button_facebook_like" fb:like:layout="button_count"></a>
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>